; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	Star6 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star5)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 Star14)
	(pointing satellite3 Star9)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 thermograph2)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Star15 thermograph2)
))

)

; plan
1. (turn_to satellite3 star9 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star9)
   goals met: 1 of 12
2. (turn_to satellite2 groundstation2 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 12
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 12
4. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 1 of 12
5. (turn_to satellite2 planet11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet11)
   goals met: 1 of 12
6. (take_image satellite2 planet11 instrument5 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 12
7. (turn_to satellite2 phenomenon8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 12
8. (take_image satellite2 phenomenon8 instrument5 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 3 of 12
9. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 12
10. (take_image satellite2 phenomenon7 instrument5 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 4 of 12
11. (turn_to satellite2 phenomenon10 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 12
12. (turn_to satellite0 star5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star5)
   goals met: 5 of 12
13. (take_image satellite2 phenomenon10 instrument5 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 6 of 12
14. (turn_to satellite2 planet12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet12)
   goals met: 6 of 12
15. (take_image satellite2 planet12 instrument5 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 7 of 12
16. (turn_to satellite2 planet13 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet13)
   goals met: 7 of 12
17. (take_image satellite2 planet13 instrument5 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 8 of 12
18. (turn_to satellite2 star15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star15)
   goals met: 8 of 12
19. (take_image satellite2 star15 instrument5 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 9 of 12
20. (turn_to satellite2 star9 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star9)
   goals met: 9 of 12
21. (take_image satellite2 star9 instrument5 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 12
22. (turn_to satellite2 star14 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star14)
   goals met: 11 of 12
23. (take_image satellite2 star14 instrument5 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 12 of 12
